package cn.itbeien.payment.enums;

public enum RespEnum {
	
	S00000("000000","处理成功"),
	E00001("e00001","通讯错误"),
	E00002("e00002","交易超时"),
	E00003("e00003","交易处理中"),
	E00004("e00004","支付渠道错误"),
	E00005("e00005","验签失败"),
	E00006("e00006","接口类型错误"),
	E00007("e00007","商户未开通该接口"),
	E00008("e00008","支付渠道异常"),
	E00009("e00009","公共参数缺失"),
	E00010("e00010","公共参数值有误"),
	E00011("e00011","敏感字段加密失败"),
	E00012("e00012","敏感字段解密失败"),
	E00013("e00013","商户已不可退款"),
	E00014("e00014","商户重复订单"),
	E00015("e00015","商户订单未成功"),
	E00016("e00016","退款汇总金额超过支付金额"),
	E00017("e00017","商户订单不存在"),
	E00018("e00018","商户订单不存在"),
	E00019("e00019","商户无代付功能"),
	E00020("e00020","商户代付功能未开启"),
	E00021("e00021","交易金额大于单笔限额"),
	E00022("e00022","商户可提余额不足"),
	E00023("e00023","因上游银行监管，目前可以提现金额"),
	E00024("e00024","渠道余额不足"),
	E00025("e00025","商户订单不存在"),
	E00026("e00026","报文有误"),
	E00027("e00027","报文为空"),
	E00028("e00028","扣减总金额大于可提现金额"),
	E00029("e00029","参数为空"),
	E00030("e00030","IP白名单不存在"),
	E00031("e00031","商户不存在"),
	E00032("e00032","商户账户不存在"),
	E00033("e00033","账户被冻结"),
	E00034("e00034","银行卡未配置白名单"),
	E00035("e00035","商户订单待处理"),
	E00036("e00036","业务未开通"),
	E00037("e00037","商户退款金额无效"),
	E00038("e00038","商户退款已存在"),
	E00039("e00039","商户订单状态异常"),
	E00040("e00040","商户订单号重复"),
	E00041("e00041","商户订单已支付"),
	E00042("e00042","商户功能待开启或处于审核中"),
	E00043("e00043","当前交易额大于单笔日交易限额"),
	E00044("e00044","当日交易额已经达到日限额"),
	E00045("e00045","商户对应支付方式不存在"),
	E00046("e00046","商户对应支付方式未开通"),
	E00047("e00047","接口必传参数不能为空，请查看接口文档"),
	E00048("e00048","支付查询业务，商户订单号不能为空"),
	E00049("e00049","获取商户支付渠道异常"),
	E00050("e00050","商户状态异常"),
	
	E00051("e00051","商户对应第三方账户未设置（渠道）"),
	E00052("e00052","订单时间戳已超时，过期"),
	E00053("e00053","单卡超过当日累积支付限额"),
	E00054("e00054","单卡超过单笔支付限额"),
	E00055("e00055","单卡超过单月累积支付限额"),
	E00056("e00056","单卡超过单日累积支付次数上限"),
	E00057("e00057","单卡超过单月累积支付次数上限"),
	E00058("e00058","付款人 IP 异常，非下单人支付"),
	E00059("e00059","卡已过期，请换卡重新支付"),
	E00060("e00060","消费金额超限，请联系发卡银行"),
	E00061("e00061","该笔交易风险较高，拒绝此次交易"),
	E00062("e00062","通道未接通"),
	E00063("e00063","业务参数为空"),
	E00064("e00064","交易类型有误"),
	E00065("e00065","参数格式有误"),
	E00066("e00066","加签失败"),
	E00067("e00067","toBankNo和toBankName中对应银行名称不一致"),
	E00068("e00068","商户冻结明细已解冻，不允许重复解冻"),
	E00069("e00069","渠道金额和数据库保存金额不等"),
	E00070("e00070","付款总笔数与明细汇总笔数不等"),
	E00071("e00071","付款总金额与明细汇总金额不等"),
	E00072("e00072","detailData参数不是15个"),
	
	E50001("e50001","风控设置有误 "),
	E50002("e50002","风控单笔订单金额超出限制"),
	E50003("e50003","风控单日订单金额超出限制"),
	E50004("e50004","风控单周订单金额超出限制"),
	E50005("e50005","风控单月订单金额超出限制"),
	E50006("e50006","风控当前订单不在时间白名单内"),
	E50007("e50007","风控当前订单不在ip白名单内"),
	E50008("e50008","风控当前订单在黑名单内"),
	E50009("e50009","支付金额不能小于0.01元"),
	E50010("e50010","支付金额格式不正确"),
	
	E50011("e50011","银行返回请求失败"),
	E50012("e50012","加密解密异常"),
	E50013("e50013","业务异常"),
	E50014("e50014","商户账号总额度已经超出额度限制"),
	E50015("e50015","未设置白名单"),
	E50016("e50016","风控设置有误 "),
	E50017("e50017","接口未获授权"),
	
	E50018("e50018","交易超过银行当月交易限额"),
	E50019("e50019","交易超过银行交易限额"),
	E50020("e50020","交易超过银行交易次数 "),
	E50021("e50021","交易超过银行成功交易次数 "),
	E50022("e50022","交易超过银行成功交易限额 "),
	E50023("e50023","银行交易超限"),
	E50024("e50024","银行风险交易拦截"),
	E50025("e50025","银行配置商户信息错误"),
	E50026("e50026","渠道订单创建失败"),
	E50027("e50027","渠道配置异常"),
	
	E50028("e50028","此卡超过当日限额"),
	E50029("e50029","此卡超过当月限额"),
	E50030("e50030","提现金额不在范围内"),
	
	E50040("e50040","渠道授权过期"),
	E50041("e50041","渠道单据号已存在"),
	E50042("e50042","渠道sign字段缺失"),
	E50043("e50043","渠道参数验证错误"),
	E50044("e50044","交易失败"),
	E50045("e50045","渠道商户未授权"),
	E50046("e50046", "通道支付方式已关闭"),
	
	E10000("e10000","未知错误类型"),
	E10001("e10001","上游系统异常"),
	E10002("e10002","jsonParam必须作为参数名,例如jsonParam={\"mercOrderNo:\":\"123456789\", \"tradeAmt\": 1}"),
	E10003("e10003","JSON格式错误"),
	E10004("e10004","页面未找到,请查阅接口文档接口是否正确"),
	E10005("e10005","请使用POST方式请求接口"),
	E10006("e10006","请检查JSON参数是否为空"),
	E99999("e99999","系统异常");

	RespEnum(String code, String desc){
		this.code = code;
		this.desc = desc;
	}
	
	// 普通方法
    public static String getDescByCode(String code) {
        for (RespEnum temp : RespEnum.values()) {
            if (code.equals(temp.getCode())) {
                return temp.getDesc();
            }
        }
        return null;
    }

	private final String code;
	
	private final String desc;
	

	public String getCode() {
		return code;
	}

	public String getDesc() {
		return desc;
	}
}
